batch_call.yaml
config:
  target: http://0.0.0.0:8545
  phases:
    - duration: 30
      arrivalRate: 20
      name: Peak Load
  processor: "./processor.js"
 
scenarios:
  - name: "ETH Call"
    beforeRequest: batch_call
    afterResponse: check_response
    flow:
      - post:
          url: "/eth"
          json: {}