batch_call.yaml
config:
  target: http://0.0.0.0:8545
  phases:
    - duration: 30
      arrivalRate: 100
      name: Peak Load
 
scenarios:
  - name: "ETH Call"
    flow:
      - post:
          url: "/eth"
          json: [{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000cb907dba330329be9364fdf1f4dd0ad8085493d9","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768876},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a082310000000000000000000000004541838755d03e914653b018147fd6315814b595","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768877},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000ba12222222228d8ba445958a75a0704d566bf2c8","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768878},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000aa1b5da30318ad384198b6309707c4d4bdfa9576","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768879},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000c37e11ad7d30db695826e1e22aa89ef07c96620f","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768880},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000770686145611f20bb9c54d4d7b068382e8687a41","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768881},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a0823100000000000000000000000004b6a0d14e495870efcdf7e038fb0e3be28744b0","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768882},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000e0c060a7093bd5810564c7edb4f28284b6bcad86","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768883},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a082310000000000000000000000003ff4b364f9697fe211220a7c2226709a29b588a2","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768884},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000c47c84ba1f7f76c665d732965398372718d8dee1","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768885},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000138eba86f5d5805d90108fddc5298bdee2124e25","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768886},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a0823100000000000000000000000006266a4f4b9bf793aa9145e18ee3bc02779919b5","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768887},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000629482c6c03b2361734eceeb6f895b0415e0eaa9","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768888},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000f18ec4ff1b23629ddc269b5b8e11ac03c7250b0a","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768889},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000838a1111a0f07df4ffe9da97123c5d3f1153a0c8","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768890},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a082310000000000000000000000002555e089b5edcef0457533cddac12af27ce3926a","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768891},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a0823100000000000000000000000054138c3d494ec7ede33ed08ee6e0f7bc6149e2fc","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768892},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a0823100000000000000000000000082a9c407c0372ab3a0310a127a5159cc687824c0","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768893},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000e59f863a4b27f7bea482633aa97f927583f996c0","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768894},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000e185cea8bc9b28f0f90ef4e5392f50a5003c0a61","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768895},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000b2af37fbd5b415a5c69b3ba1fd019532bec3365b","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768896},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000a720a3688b4130fb06ad99c0c5aeaf28ebefd653","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768897},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000c4e0e359d35348e941b9acc8307228fd5610dab3","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768898},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000d22929ee467904ac9560f6d0005e90e8bb7713b6","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768899},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000398c0bb709e1f3872df3842e353ed8b28f56f9c2","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768900},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000c5c0bec18ded4ede00c45961f56fc175e7590869","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768901},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a0823100000000000000000000000041e30d0796ded67f9b3be612cb463209c7531771","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768902},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000b6f630cfd77c3d5edb18c09ee2e57bb8c9e7e12a","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768903},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000ad03a0224442b9174d27b6cfc34c80969fa3761e","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768904},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000a5c7791522f21d9b0a00e4d1dc075078ebacf192","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768905},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000f06d048f3c991101d6d67497dd811e4bebcce042","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768906},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000c6d0f9ddf2e4bfbcc499513b38bdc5d75dbbf58f","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768907},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a082310000000000000000000000001a56349292995c7b8d094333619d89bc2c01d0ed","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768908},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000d782d2f294bbcdc6259751f20bbf95965ff7de46","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768909},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000c419a6af78cccec141b0697543e6b06837f7d56e","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768910},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000bfc5d24236587f256a5cc48531466a849b16d95a","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768911},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000dcd48c3fc8acb1fca68a17e92a45c6c44297dd2a","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768912},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a082310000000000000000000000009c8e619a8d54d06b40c6f1d935f7569d42e2809f","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768913},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a0823100000000000000000000000081131ce3a243668ac4dc393ef7b20007cded1de5","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768914},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a0823100000000000000000000000066dd48889df1fc32cba3abfa2c453906d527eb2e","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768915},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a082310000000000000000000000006992b2d760587e07159445c967e02312fa57dea0","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768916},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000345c32aab81fe01200504dfff6c8439d743c8f8a","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768917},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a0823100000000000000000000000000d24f6e376d58b9038e0da257a8de23b64e3a75","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768918},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000ebd2db14d4d5bb2c5c6709d65c0a5259b839da45","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768919},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000a15a193124f0c85b1b47cd5353dc5722ac480df8","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768920},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a082310000000000000000000000005fff2c22f28f00341c9a556fc7f51b628d79e97f","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768921},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000461f3def0cc75af627e112e2c01863e62afad8ec","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768922},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a082310000000000000000000000006ac3deba6bd7d6d9fb050d0b24155b508b55a010","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768923},{"jsonrpc":"2.0","method":"eth_call","params":[{"data":"0x70a08231000000000000000000000000ccf00a437b7081a6193201aca14861678b58c682","to":"0x4b13006980acb09645131b91d259eaa111eaf5ba"},"latest"],"id":200768924}]