single_call.yaml
config:
  target: http://0.0.0.0:8545
  phases:
    - duration: 30
      arrivalRate: 20
  processor: "./processor.js"
 
scenarios:
  - name: "ETH Call"
    beforeRequest: single_call
    afterResponse: check_response
    flow:
      - loop:
          - post:
              url: "/eth"
              json: {}
        count: 50